<?php
    $loacalender = [
        'weekdays' => [
            'shorthand' => ['ອາທິດ', 'ຈັນ', 'ອັງຄານ', 'ພຸດ', 'ພະຫັດ', 'ສຸກ', 'ເສົາ'],
            'longhand' => [
                'ວັນອາທິດ',
                'ວັນຈັນ',
                'ວັນອັງຄານ',
                'ວັນພຸດ',
                'ວັນພະຫັດ',
                'ວັນສຸກ',
                'ວັນເສົາ',
            ],
        ],
        'months' => [
            'shorthand' => [
                'ມ.ກ.',
                'ກ.ພ.',
                'ມ.ນ.',
                'ມ.ສ.',
                'ພ.ພ.',
                'ມິ.ຖ.',
                'ກ.ລ.',
                'ສ.ຫ.',
                'ກ.ຍ.',
                'ຕ.ລ.',
                'ພ.ຈ.',
                'ທ.ວ.',
            ],
            'longhand' => [
                'ມັງກອນ',
                'ກຸມພາ',
                'ມີນາ',
                'ເມສາ',
                'ພຶດສະພາ',
                'ມິຖຸນາ',
                'ກໍລະກົດ',
                'ສິງຫາ',
                'ກັນຍາ',
                'ຕຸລາ',
                'ພະຈິກ',
                'ທັນວາ',
            ],
        ],
    ];
    

    return json_encode($loacalender);

?>